////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Параметры:
//  Константа     - ПланВидовХарактеристикСсылка.Композит_КонстантыРазработки - Предопределенный или найденный элемент ПВХ. Можно задать массив констант
//                - Строка      - Код элемента ПВХ Константы разработки или Идентификатор. Через запятую можно указать несколько значений
//  ДатаКонстанты - Дата, на которую действует константа. Если не передать, получаем на текущую дату
//  ВозвращатьСписок - Булево - Получать структуру со значением константы и дополнительной коллекцией
// 
// Возвращаемое значение:
// Соответсвие - Если необходимо получить значение константы и приложенную коллекцию, содержит структуры с 2мя элементами:
//             - Значение  - Значение константы или текст "Не удалось найти константу по коду",.
//             - Коллекция - Хранилище значения с дополнительной коллекцией или Неопределено.
///Соответсвие - Если константа является логином и паролем, содержит структуры с 2мя элементами:
//             - Логин 
//             - Пароль
// Неопределено, если константа не найдена
// Значение константы
Функция ПолучитьКонстанту(Константа, ДатаКонстанты = Неопределено, ВозвращатьСписок = Ложь) Экспорт
КонстантаВходящая = Константа;

	Ответ = Новый Соответствие;
	ТипКлюча = 2;
	Если ДатаКонстанты = Неопределено Тогда

		ДатаКонстанты = ТекущаяДатаСеанса();

	КонецЕсли;

	Если ТИПЗНЧ(Константа) = ТИП("Строка") Тогда

		МассивКонстант = Новый массив;

		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Константа, ",");

		Для Каждого Строка Из МассивСтрок Цикл

			Ответ.Вставить(Строка, Неопределено);

			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Строка) Тогда   // Передан код
				ТипКлюча = 0;
				Константа = ПланыВидовХарактеристик.pr_ЛокальныеКонстанты.НайтиПоКоду(Строка);

			Иначе
				ТипКлюча = 1;
				Константа = ПланыВидовХарактеристик.pr_ЛокальныеКонстанты.НайтиПоРеквизиту("Идентификатор",
					Строка);

			КонецЕсли;

			Если Константа <> Неопределено Тогда

				МассивКонстант.Добавить(Константа);

			КонецЕсли;

		КонецЦикла;

	ИначеЕсли ТИПЗНЧ(Константа) = ТИП("ПланВидовХарактеристикСсылка.pr_ЛокальныеКонстанты") Тогда

		МассивКонстант = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Константа);
	Иначе
		МассивКонстант = Константа;
		Для Каждого Конст Из Константа Цикл
			Ответ.Втсавить(Конст, Неопределено);
		КонецЦикла;
	КонецЕсли;

	pr_ЛокальныеКонстантыПовтИсп.ПолучитьКонстанту(Ответ, МассивКонстант, ДатаКонстанты, ВозвращатьСписок,
		ТипКлюча);

	Если Ответ.Количество() = 1 Тогда
		Возврат Ответ[КонстантаВходящая];
	Иначе
		Возврат Ответ;
	КонецЕсли;
КонецФункции // ПолучитьКонстантуРазработки()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти