

#Область аа
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	коллекция = pr_ЛокальныеКонстантыСервер.ПолучитьКонстанту("Коллекция",,Истина);
	пароль = pr_ЛокальныеКонстантыСервер.ПолучитьКонстанту("Пароль");
	константа = pr_ЛокальныеКонстантыСервер.ПолучитьКонстанту("Константа");
	
	// Извращение для ЕДТ, не показывает еременную, если она не используется дальше
	А = Коллекция;
	Б = пароль;
	к = Константа;
	
		// Пример вызова нескольких констант одновременно
	ВсеКонстанты =  pr_ЛокальныеКонстантыСервер.ПолучитьКонстанту("Коллекция,Пароль,Константа");
	// та же проблема
	ВК = ВсеКонстанты;
	
	ВсеКонстантыСКоллекциями =  pr_ЛокальныеКонстантыСервер.ПолучитьКонстанту("Коллекция,Пароль,Константа",,Истина);
	// та же проблема
	ВКСК = ВсеКонстантыСКоллекциями;
КонецПроцедуры
#КонецОбласти
