////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы
&НаСервереБезКонтекста
Процедура ПослеЗаписиНаСервере()
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запись.Период = НачалоГода(ТекущаяДатаСеанса());

	ОписаниеКонстанты = ПолучитьОписаниеКонстанты(Запись.Константа);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КонстантаПриИзменении(Элемент)
	ОписаниеКонстанты = ПолучитьОписаниеКонстанты(Запись.Константа);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&наСервереБезКонтекста
Функция ПолучитьОписаниеКонстанты(Константа)

	Результат = "Описание не задано";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КР.Описание
	|ИЗ
	|	ПланВидовХарактеристик.pr_ЛокальныеКонстанты КАК КР
	|ГДЕ
	|	КР.Ссылка = &Константа";

	Запрос.УстановитьПараметр("Константа", Константа);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Описание;
	КонецЕсли;

	Возврат Результат;
КонецФункции
#КонецОбласти