
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОбъектДляПостройки = pr_ДинамическоеФормированиеИнтерфейсаПовтИсп.ОбъектДляСборкиЭлементовФормы(Объект.ИдентификаторМакета);
		
		pr_ДинамическоеФормированиеИнтерфейсаСервер.СобратьГруппуЭлементовИзXML(ЭтотОбъект,ОбъектДляПостройки,"СтроимЗдесь");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Текст = Макет.ПолучитьТекст();
	ТекущийОбъект.Макет = Новый ХранилищеЗначения(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Текст = ТекущийОбъект.Макет.получить();
	Макет.УстановитьТекст(Текст);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти